Revit 2026 API

# ClassificationEntries Properties

---

The ClassificationEntries type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from KeyBasedTreeEntries) |

#### Reference

ClassificationEntries Class

Autodesk.Revit.DB Namespace